---
kind: property
id: P:Autodesk.Revit.DB.RevitLinkOptions.IsRelative
source: html/a08a6ba9-264f-9842-b279-637a597f2ba8.htm
---
# Autodesk.Revit.DB.RevitLinkOptions.IsRelative Property

The type of path to use when creating the link. If true, Revit will
 store a relative path for the link. If false, Revit will store an absolute
 path.
If the link is to a Revit Server location, isRelative must be false.

## Syntax (C#)
```csharp
public bool IsRelative { get; set; }
```